#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВКМ_ВидимостьЭллементовФормы();
КонецПроцедуры
#КонецОбласти 


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВКМ_ВидДоговораПриИзменении(Элемент)
	
	ВКМ_ВидимостьЭллементовФормы();
	
КонецПроцедуры
#КонецОбласти    


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВКМ_ВидимостьЭллементовФормы()
	
	Видимость = Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание");
	
	Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость 		= Видимость;
	Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость 	= Видимость;
	Элементы.ВКМ_СуммаЕжемесячнойАбоненсткойПлаты.Видимость = Видимость;
	Элементы.ВКМ_СтоимостьЧасаРабот.Видимость 				   = Видимость;
	
КонецПроцедуры
#КонецОбласти