
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТЧ = ПолучитьИзВременногоХранилища(Параметры.Объект);
	Год = ПолучитьИзВременногоХранилища(Параметры.Год);
	
	ВКМ_ДГ.Обновление = Ложь;
	ВКМ_ДГ.АвтоОпределениеПолногоИнтервала = Ложь;
	ВКМ_ДГ.Очистить();
	
	ВКМ_ДГ.УстановитьПолныйИнтервал(НачалоГода(Год), КонецГода(Год));
	Серия = ВКМ_ДГ.УстановитьСерию("Отпуска");
		
	Для Каждого Сотрудник Из ТЧ Цикл 
		
		Точка = ВКМ_ДГ.УстановитьТочку(Сотрудник.ВКМ_Сотрудник);
		Точка.Картинка = БиблиотекаКартинок.СостояниеПользователя02;
		Значение = ВКМ_ДГ.ПолучитьЗначение(Точка, Серия);
		Значение.Данные.ВКМ_ДнейОтпуска = Значение.Данные.ВКМ_ДнейОтпуска + Сотрудник.ВКМ_ЧислоДнейОтпуска;
		Если Сотрудник.ВКМ_ЧислоДнейОтпуска > 28 Тогда 
			Значение.ЦветФона = WebЦвета.ЗеленоЖелтый;
		КонецЕсли;
				
		Интервал = Значение.Добавить();
		Интервал.Начало = Сотрудник.ВКМ_ДатаНачала;
		Интервал.Конец = Сотрудник.ВКМ_ДатаОкончания;
		
	КонецЦикла;
	
	Шкала = ВКМ_ДГ.ОбластьПостроения.ШкалаВремени.Элементы[0];
	Шкала.Метки.Очистить();
	МеткиВремени = Шкала.Метки.Добавить(НачалоДня(ТекущаяДата())); 
	МеткиВремени.Текст = "Текущая дата " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	МеткиВремени.ЦветТекста = WebЦвета.Охра;
	МеткиВремени.ЦветЛинии = WebЦвета.Охра; 
	
	ВКМ_ДГ.Обновление = Истина;
	
КонецПроцедуры
